examples/urbanclimate/templates/streetCanyon_CFD/0/air/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5; 

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0; 
        value           uniform 1e5; 
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 1e5; 
    }
    air_to_street
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 1e5; 
    }
    air_to_windward
    {
        type            fixedFluxPressure;
        gradient        uniform 0; 
        value           uniform 1e5; 
    }
    air_to_leeward
    {
        type            fixedFluxPressure;
        gradient        uniform 0; 
        value           uniform 1e5; 
    }
    side1
    {
        type            slip;
    }
    side2
    {
        type            slip;
    }
    buildings
    {
        type            fixedFluxPressure;
        gradient        uniform 0; 
        value           uniform 1e5; 
    }
}


// ************************************************************************* //
