examples/urbanclimate/templates/streetCanyon_CFD/system/air/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-9;
        relTol           0.01;

        smoother         DICGaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;

        maxIter          100;
    }

    "(U|k|epsilon|w)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.01;
    }
    "(h|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.01;
        minIter         1;
        maxIter         100;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    
    residualControl
    {
        p_rgh           1e-3;
        U               1e-4;
        h               1e-4;
        w               1e-4;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-4;
    }
}


relaxationFactors
{
    fields
    {
        rho             1.0;
        p_rgh           0.5;
    }
    equations
    {
        U               0.7;
        "(h|e)"         0.9;
        k               0.5;
        epsilon         0.5;
        w               0.9;
    }
}


// ************************************************************************* //
